{"FritaBatidos": {"data": [{"created_time": "2017-11-25T07:33:46+0000", "message": "HAPPY FACEBOOK FRIDAY! We hope everyone had a great holiday! In celebration of the beginning of Christmas holidays - the winner this week will receive a bucket of our Seasonal Sam Adams Winter Lager! Don't forget to like, comment and tag a friend! #fritabatidos #frita #batidos #holidays #winterishere #lightsareupandeverything #winterlager #beer #samadams #bucketofbeer #onlyatfrita #tagafriend #annarbor #seasonalspecials", "id": "157807164239203_1722696984416872"}, {"created_time": "2017-11-22T23:54:39+0000", "message": "We will be closed tomorrow for Thanksgiving and will re-open Friday at 11am! We apologize for any inconvenience this may cause! Thank you kindly and Happy Holidays from everyone @ Frita!", "id": "157807164239203_1720012804685290"}, {"created_time": "2017-11-19T01:53:54+0000", "message": "I would love the updated catering menu when it's available!", "id": "157807164239203_1715977325088838"}, {"created_time": "2017-11-18T01:45:41+0000", "message": "Happy Facebook Friday!  This weeks winner gets to bring some friends and enjoy a vegetarian feast anytime this week!  Like, comment, AND tag your friends to win!  #vegetarianfeast #fritabatidos #tagafriend #uofm #plantains #bestsnackever #loadedplantains #lightbrightsalad #twicefriedplantains", "id": "157807164239203_1714940698525834"}, {"created_time": "2017-11-17T18:47:52+0000", "story": "Frita Batidos shared All About Ann Arbor's post.", "id": "157807164239203_1714642681888969"}, {"created_time": "2017-11-11T16:02:49+0000", "message": "In commemoration of Veterans day, Frita Batidos would like to thank you for all of your sacrifice and bravery.  Come visit us today and with our compliments  receive a Frita of your choosing with a coke and a smile!", "id": "157807164239203_1707987152554522"}, {"created_time": "2017-11-10T20:54:35+0000", "message": "Happy Facebook Friday!  This weeks winner will win 2 of our Picadillo Fritas with your choice of toppings and a Large Garlic Cilantro Fry.  This is your last chance to try this delicious Frita so get it while it lasts!  Like, comment, and tag a friend to win!  #picadillofrita #fritabatidos #annarbor #uofm #bestfoodannarbor #fab5 #tagafriend", "id": "157807164239203_1707142425972328"}, {"created_time": "2017-11-04T03:49:23+0000", "message": "HAPPY FACEBOOK FRIDAY! Welcoming the U of M Parents Weekend with a prize of our Seasonal Plantain Fried Chicken for two!  Served with Coconut Ginger Rice, Slow Cooked Black Beans, Cilantro Lime Salsa and Mojo sauce! Don't forget to like, comment and tag a friend to win! #fritabatidos #plantainfriedchicken #seasonalspecial #coconutgingerrice #cilantrolimesalsa #facebookfriday #tagafriend #annarbor #uofm #parentsweekend", "id": "157807164239203_1700223009997603"}, {"created_time": "2017-10-28T02:58:34+0000", "message": "HAPPY FACEBOOK FRIDAY! Come on into Frita Batidos to embrace the cold weather with us! This week's winner will receive a round of 4 Mulled Sangria's for them and their friends! Don't forget to LIKE, COMMENT AND TAG A FRIEND! #fritabatidos #mulledsangria #embracethecold #winteriscoming #tagafriend #facebookfriday", "id": "157807164239203_1692799204073317"}, {"created_time": "2017-10-20T18:11:16+0000", "message": "Happy Facebook Friday!!!!  This weeks winner wins a basket of our Shoestring Fries AND a basket of our Garlic Cilantro Fries.  Like, tag a friend, AND comment to win!  #fries #garliccilantro #shoestringfries #UofM #tagafriend", "story": "Frita Batidos is with David Chambers and Deb Ivans.", "id": "157807164239203_1685193891500515"}, {"created_time": "2017-10-16T15:03:31+0000", "message": "We had a minor equipment malfunction this morning.  We will open promptly at 12 pm.  We apologize for the inconvenience!  Everyone @Frita!!!", "id": "157807164239203_1681147298571841"}, {"created_time": "2017-10-13T22:17:22+0000", "message": "Haaaaaaaappppppyy Facebook Friday!  This weeks winner wins a Bucket of our Atwater Seasonal, Dirty Blonde, to be claimed during any Happy Hour this week!  Like, comment, AND tag your friends to win!  #atwater #fritabatidos #uofm #annarbor #happyhour #dirtyblonde #bucketofbeer #tagafriend", "id": "157807164239203_1678469895506248"}, {"created_time": "2017-10-07T19:51:23+0000", "message": "Happy Facebook \"Friday\"! #Iguessfootballweekendgotthebestofus :/ This week's prize is a happy hour experience for two! To be enjoyed any Happy Hour this week @Frita Batidos (Sun-Thurs 4-6 and the last hr of service nightly) #besthappyhourintown #footballweekendsatfritaarethebest #tequieromucho", "id": "157807164239203_1672476456105592"}, {"created_time": "2017-10-03T21:08:16+0000", "message": "October is See Pink Go Blue Month! Help us take on breast cancer! A portion of the proceeds from our See Pink item, which is our Pisco-Hibiscus Lemonade, will go to breast cancer education, research and care at the U of M Breast Care Center. Come give your support! #seepink #goblue #breastcancer #uofm #annarbor #donate #pisco #hibiscus #lemonade", "id": "157807164239203_1668664276486810"}, {"created_time": "2017-09-30T01:12:10+0000", "message": "HAPPY FACEBOOK FRIDAY! There is a chill in the air and this week's price is the perfect transition to Autumn! The winner will receive a round of Steaming Mulled Sangrias for you and your besties! (you + 3) :) A drink that goes with every season! Don't forget to like AND comment to win! #fritabatidos #facebookfriday #mulledsangria #readyforautumn #steaming #besties #onlyatfrita #foreveryseason #keepsyouwarm #duringthechillytime #likeandcomment #seeyousoon", "id": "157807164239203_1665070390179532"}, {"created_time": "2017-09-26T21:25:49+0000", "message": "It's Happy Hour!!! Join us and enjoy our Beef Frita for $5, small Shoestring or Garlic Cilantro Fries for $1.50, our Mini Best Snack for $3.50,  $3.00 Cuba Libres, and $1 off all beers.  It's the best Happy Hour in town!  Sunday through Thursday 4-6pm and last hour of service, nightly! #tagafriend #happyhour #uofm #bestofannarbor  #fritabatidos", "id": "157807164239203_1662382647114973"}, {"created_time": "2017-09-23T00:39:05+0000", "message": "Happy FACEBOOK FRIDAY!! This week's winner will win our newly added Seasonal Special = Picadillo Frita for two to be claimed anytime this coming week! Cuban Inspired Beef Hash served on a Brioche with Shoestring Fries and Sweet Chili Mayo! Sweet, Savory and Spicy! Don't forget to like AND comment to win!   #fritabatidos #seasonalspecial #picadillo #picadillofrita #cubaninspired #beefhash #yummy #annarbor #facebookfriday", "id": "157807164239203_1658937190792852"}, {"created_time": "2017-09-19T23:06:42+0000", "message": "Looks so tantalizing :)   Thank you All About Ann Arbor for sharing this!", "story": "Frita Batidos shared All About Ann Arbor's video.", "id": "157807164239203_1655946004425304"}, {"created_time": "2017-09-16T01:39:36+0000", "message": "HAPPY FACEBOOK FRIDAY!!!   Nothing brings people together like this weeks prize... Churros Espanol(to be claimed anytime this week)  Tag a friend, like AND comment to win!!!  #churrosespanol #fritabatidos #tagafriend  #facebookfriday #bestchurrosinannarbor #chocolateespanol", "id": "157807164239203_1652234534796451"}, {"created_time": "2017-09-09T01:33:19+0000", "message": "Happy Facebook Friday and welcome back students!!! This weeks prize is our delicious Plantain Fried Chicken for you and a friend(to be claimed during any of our Happy Hours).  Like AND comment to win!!!  #plantainchicken #fritabatidos #nomnomnom #delicious #annarbor #welcomebackstudents #goblue", "id": "157807164239203_1645532042133367"}, {"created_time": "2017-09-02T02:01:24+0000", "message": "Haaaaaaaaappy Facebook Friday!  This weeks winner gets there choice of our Lighter Plate, Gazpacho, or Light Bright Salad for 2 featuring Green Things Farm heirloom and cherry tomatoes (to be enjoyed anytime this week).  Like AND comment to win!!!  #greenthingsfarm #fritabatidos #annarbor #michigan #uofm", "id": "157807164239203_1639032052783366"}, {"created_time": "2017-08-30T02:37:57+0000", "message": "So excited about another local farmer and collaboration!  Come visit us to taste these Green Things Farm tomatoes - available right now!!!  You will find them on our Light Bright Salad, Lighter Plate, and Chili Lime Gazpacho!  Get these beautiful tomatoes while the getting is good - Tomato season won't last forever you know! #GreenThingsFarm #fritabatidos #tomatoseason #beautifultomatoes", "story": "Frita Batidos added 2 new photos.", "id": "157807164239203_1636192076400697"}, {"created_time": "2017-08-27T14:24:59+0000", "message": "CHEFS IN THE GARDEN TONIGHT = US!\n\nExcited for tonight!  #growinghope #urbanfarm #tradition", "story": "Frita Batidos shared growing hope's event.", "id": "157807164239203_1633881899965048"}, {"created_time": "2017-08-26T00:07:33+0000", "message": "Happy Facebook Friday!  This week prize is ...... Dos Locos(two Locos) of your choosing!  Tag your partner in crime, like, AND comment to win.  Good luck!  #fritabatidos #doslocos #tagafriend #annarbor #bestofannarbor", "story": "Frita Batidos is with Judee Lonnemo.", "id": "157807164239203_1632385753447996"}, {"created_time": "2017-08-20T17:59:14+0000", "message": "Don't forget to come celebrate the Summer Harvest and support a phenomenal and important cause! TODAY from 4-6pm we will be closing Frita Batidos and making a giant, WORLD CLASS FEAST in support of our dear friend, Farmer Melvin Parson, and the world class urban farm he is building in Ypsi - growing bountiful produce, community and jobs for formerly incarcerated individuals - We will be roasting a side of Black Oak Farms Pork - Accompainied with spicy greens straight from Wtpga - Mexico City Corn - Buttermilk Biscuits - Tropical Slaw - Tres Leches with MI Summer Fruit and even FRITA MOONSHINE! How can you turn that down?! \n\nPlease help us support Farmer Parson and you will leave w/a full belly and stockpile of GREAT Karma ♥ $35 per person - $10 for kids and Pick up orders (AKA Feast To Go). You can call us at 734-761-2882 to make your reservation or you can just show up!!! #youcantbelievethedifferencethisguyismaking #dreambigorgohome #teamworkmakesthedreamwork #farmtotableforreal #wtpga #frita #fritafeastsarethebestfeasts", "id": "157807164239203_1627345293952042"}, {"created_time": "2017-08-19T22:33:18+0000", "message": "Happy Facebook Weekend (sorry we missed the boat yesterday)!  This weeks prize is our Spicy Chorizo and Local Greens for 2(to be enjoyed anytime this week)!  Layered house made Spicy Chorizo, Lacinato and Russian Kale over Coconut Ginger Rice with Cilantro Lime Salsa.  Highlighting We The People's Growers Association farm in Ypsilanti!  Like AND comment to win!  \n\nP.S.  We are having our Summer Feast tomorrow, 8/20 from 4 pm to 6 pm to support Farmer Melvin Parson and his world class farm!  Come in tomorrow and help us support a good cause!  #fritabatidos #worldclassfarm #FarmerParson #comesupportagoodcause #summerfeast #tagafriend", "id": "157807164239203_1626540950699143"}, {"created_time": "2017-08-12T03:19:13+0000", "message": "Come celebrate the Summer Harvest and support a phenomenal and important cause!  Sunday, August 20th from 4-6pm we will be closing Frita Batidos and making a giant, world class feast in support of our dear friend, Farmer Melvin Parson, and the world class urban farm he is building in Ypsi - growing bountiful produce, community and jobs for formerly incarcerated individuals - We will be roasting a side of Black Oak Farms Pork - Accompainied with spicy greens straight from Wtpga - Mexico City Corn - Buttermilk Biscuits - Tropical Slaw -  Tres Leches with MI Summer Fruit and even FRITA MOONSHINE!  How can you turn that down?!  \n\nPlease help us support Farmer Parson and you will leave w/a full belly and stockpile of GREAT Karma <3   $35 per person - $10 for kids and Pick up orders (AKA Feast To Go).  You can call us at 734-761-2882 to make your reservation or you can just show up!!!   #youcantbelievethedifferencethisguyismaking #dreambigorgohome #teamworkmakesthedreamwork #farmtotableforreal #wtpga #frita #fritafeastsarethebestfeasts", "story": "Frita Batidos added an event.", "id": "157807164239203_157026111516797"}, {"created_time": "2017-08-12T01:31:18+0000", "message": "Happy Facebook Friday!  This weeks prize is 2 of our favorite seasonal specials - our Mexico City Corn and Chile-Lime Gazpacho for 2!!! Remember to like AND comment to win! #getitwhileitshot #mexicocitycorn #chilelimegazpacho #seasonalspecials #fritabatidos #cantmissthis", "story": "Frita Batidos added 2 new photos.", "id": "157807164239203_1618968804789691"}, {"created_time": "2017-08-10T23:32:58+0000", "message": "Our favorite time of the year has arrived!  Late Summer/almost early Autumn (and Winter is still safely far away:) and the Michigan growing season is reaching it's peak!!!  Come get what you've been waiting for <3  #michigancorn #mexicancorn #chililimegazpacho #comeandgetit #fritafrita", "story": "Frita Batidos added 2 new photos.", "id": "157807164239203_1617945731558665"}, {"created_time": "2017-08-05T01:44:05+0000", "message": "Happy Facebook Friday!!! This weeks winner get to enjoy a bucket of our seasonal beers with their friends(you can choose from Atwater, Sam Adams, Shorts, Founders, Bells, New Belgium, PBR, Dos Equis, and Negra Modelo). Like, tag a couple of your friends, AND comment to win!!! #fritabatidos #bucketofbeer #seasonal #tagafriend #bringafriend #plentytogoaround #beerisgood", "id": "157807164239203_1612094598810445"}, {"created_time": "2017-07-29T03:24:14+0000", "message": "TELL US WHAT YOU WANT, WHAT YOU REALLY REALLY WANT! \n\nHAPPY FRITA FACEBOOK FRIDAY!!!  BC IT'S FB FRIDAY AND BC I'M DELIRIOUS AND BC WE LOVE YOU - TELL US WHAT YOU WANT (WHAT YOU REALLY REALLY WANT) THIS WEEK?!\n\nHAPPY FACEBOOK FRIDAY FRITA COMMUNITY <3  LIKE AND COMMENT TO WIN #wannabe #flavorfulnotspicy #zigazigah #fritafriday", "id": "157807164239203_1605274092825829"}, {"created_time": "2017-07-21T22:26:31+0000", "message": "Happy Facebook Friday!  This week's prize is...any 2 items of your choosing from our NEW EXPRESS MENU!  Available exclusively at that how do I pick up window@Frita.  (With special pricing and timing). Our Express Menu consists of our Aromatic Pulled Pork Sandwich, Best Snack Ever, \n Churros/Churros Espanol, and Mexican Coke.  (and hint hint the more popular it becomes, the more menu items we can add to the menu! :)  Like AND comment to win!!!  #expresswindow #tagafriend #fritabatidos #fastgooddeals #churros #pulledpork #mexicancoke #bestsnackever", "story": "Frita Batidos is at Frita Batidos.", "id": "157807164239203_1597568230263082"}, {"created_time": "2017-07-18T19:36:02+0000", "message": "FYI our Conch Fritters are back!!! Served small or large, with Lemon Scented Mayo, Creme Fraichè, and Cilantro Lime Salsa!  Dont forget about our Conch Po Boy too!  #seasonalspecials #conchfritters #getitwhileitshot #conchpoboy   #fritabatidos", "id": "157807164239203_1594257853927453"}, {"created_time": "2017-07-15T06:27:09+0000", "message": "Hello and Happy Friday!  What a great night it is...This week's Frita Facebook Friday Contest Prize is your choice of a Vegetarian Feast or a Light Feast....I think we may surprise you :) No pics so you can use your imagination but we promise, the winner will not leave hungry (!!!)   \n\nLIKE AND COMMENT TO WIN!", "id": "157807164239203_1590542590965646"}, {"created_time": "2017-07-13T19:30:21+0000", "message": "Pop up time!! We are so excited to be collaborating with Chef Gregory Leon of the celebrated Amilinda restaurant in Mke WI - We will be joining forces to create a delicious feast for you and yours and hope you can join us on August 7th in Milwaukee - Please reach out to Amilinda at (414) 369-3683 to make a reservation! HOPE TO SEE YOU THERE! \nhttp://amilinda.com", "id": "157807164239203_1588417817844790"}, {"created_time": "2017-07-13T18:50:57+0000", "message": "Woohoo!!! Thank you so much for the mention Best Food Ann Arbor:)!!!", "story": "Frita Batidos shared Best Food Ann Arbor's post.", "id": "157807164239203_1588390157847556"}, {"created_time": "2017-07-13T04:35:58+0000", "message": "best food on our tour so far...", "id": "157807164239203_1587695574583681"}, {"created_time": "2017-07-08T18:05:21+0000", "message": "Happy Facebook weekend :-) back by popular demand!  Come in for a flight of our new Cuban Inspired Iced Coffees... pungent and aromatic - brewed with demerara sugar and served straight up, with Chocolate Espanol, or our house made goats milk caramel! Bring friends because you have three big cups coming at ya :)\n\nLike AND comment to win!!! \n\n#summer #cubanicedcoffee #nothingbutthebest #getitwhileitshot #frita", "id": "157807164239203_1582913405061898"}, {"created_time": "2017-07-02T16:34:29+0000", "message": "We will be closing at 3 pm on Tuesday, July 4th!  We will be reopening at 11 am on Wednesday, July 5th.  We apologize for any inconvenience this may cause. Happy 4th of July!  Thank you kindly!", "id": "157807164239203_1576203735732865"}, {"created_time": "2017-07-01T03:43:54+0000", "message": "Happppppppppy Frita Facebook Friday!  and in honor of our win at the Detroit Burger Battle, we want to offer a pair of our winning Frita aka Burger!  (but full sized, of course!) The beef Frita with melted muenster, sweet chili mayo,  cilantro lime salsa, shoestring fries and finally, a quail's egg!  We had an exceptional day working together and really hope you ENJOY!\n\nLIKE AND COMMENT TO WIN!", "story": "Frita Batidos added 2 new photos.", "id": "157807164239203_1574418202578085"}, {"created_time": "2017-06-26T02:43:29+0000", "message": "Yayyyy and especially meaningful because we are opening in Detroit this year! <3 #equipo #teamworkmakesthedreamwork #beeffrita #thankyoufairwaypacking #thankyoudetroitnews!!!", "id": "157807164239203_1568159123203993"}, {"created_time": "2017-06-26T00:13:14+0000", "message": "Yayyyy and especially meaningful because we are opening in Detroit this year! <3 #yayyywewon #detroitburgerbattle #equipo #teamworkmakesthedreamwork #beeffrita #thankyoufairwaypacking #thankyoudetroitnews!!! #thankyoueveryoneforyoursupport #happy #detroitherewecommmmmmee", "story": "Frita Batidos is with Carlos Fernandez and 5 others.", "id": "157807164239203_1568060693213836"}, {"created_time": "2017-06-24T04:42:52+0000", "message": "HAPPY FRITA FACEBOOK FRIDAY!  Pick your pleasure!\n\nThis week's winner can come in w/friends for four fabulous drinks of your choice - From Cuban Inspired Iced Coffee, to Lush Seasonal Cocktails - to an ice cold beer to a round of batidos!  Relax@Frita and we will throw in a large basket of Garlic Cilantro Fries bc Por Que No?!  \n\nLIKE AND COMMENT TO WIN! and PS Come see us at Shed 5 this Sunday for the Detroit Burger Battle!  \n\n<3 Happy Summer <3", "id": "157807164239203_1566064506746788"}, {"created_time": "2017-06-23T15:48:57+0000", "message": "Don't forget to come support us for the title of the 'Best Burger In Detroit' for 2017! Burger Battle Detroit May the Best Burger win!! #fritabatidos #frita #beeffrita #burgerbattle2017 #burgerbash #eaternmarket #shed5 #detroit #whowillwin", "id": "157807164239203_1565407463479159"}, {"created_time": "2017-06-20T22:44:23+0000", "message": "Come check us out at the \"Burger Battle\" this Sunday, June 25th at Eastern Market, Shed 5! Burger Battle Detroit May the best burger win! #fritabatidos #burgerbattle2017 #burgerbash #bestburger #bestofannarbor #beeffrita #itcantgetanybetter #easternmarket #shed5 #detroit #burger", "id": "157807164239203_1562187393801166"}, {"created_time": "2017-06-18T13:22:49+0000", "message": "I see you on FOX 2 Detroit prepping for the Detroit Burger Battle! Looks amazing!", "id": "157807164239203_1559473824072523"}, {"created_time": "2017-06-17T03:09:06+0000", "message": "Your wish is our command!  We have been asked for a while to include another Vegetarian option to the Frita Batidos Happy Hour Menu so....Voila....Mini 'BSE' is now officially available for HH!  HAPPY FACEBOOK FRIDAY!  This week's prize is a Happy Hour experience for two! Come in and get whatever your heart desires from the Happy Hour Menu during any Happy Hour this week - Have yourself a Happy Hour Party for two - Go all out!  \n\nLIKE AND COMMENT TO WIN!  #dontholdback #dontleavehungry #happyhouratfrita #myfav #happyfbfriday #ontime", "id": "157807164239203_1557952934224612"}, {"created_time": "2017-06-12T17:50:42+0000", "message": "Don't forget about our 'Express Window'! Need a quick lunch, snack or dinner? Come up to our window and choose from our featured 'Express Menu' - such as our churros (aromatic pulled pork, a bottle of Coke and more) - and you'll be on your way in 10 minutes!! W/special Express Window pricing to boot! #expresswindow #churros #andmore #expressmenu #fastgooddeals #onlyatfrita #dessert", "id": "157807164239203_1552111181475454"}, {"created_time": "2017-06-11T02:21:10+0000", "message": "I'm a day late and a dollar short - So sorry!  Happy Frita Facebook Saturday :) To make up for my tardiness, there will be two winners this week!  This week's prize = A basket of 'Hot Mess Fries' (Our shoestring fries tossed with garlic cilantro butter, jalapenos, scallions, bacon and smothered in Muenster.  (They are pretty ridiculous - in a good way:) + a Bucket of Beer to share with friends (local, seasonal, Latin - Combination = Winner's Choice:) All to be enjoyed during any Happy Hour this week@Frita!  (Sun-Thurs 4-6 or last hr of service nightly!)\n\nLIKE ANNDDDD COMMENT TO WIN!", "story": "Frita Batidos added 2 new photos.", "id": "157807164239203_1550066198346619"}, {"created_time": "2017-06-03T04:13:42+0000", "message": "HAPPY FACEBOOK FRIDAY!  TRUE STORY = WE NOW HAVE CUBAN INSPIRED COLD BREW!  After working through the Winter to develop a delicious custom Frita blend with our dear friends at Zingerman's Coffee Company, we are so excited to announce the arrival of our earthy, toasty, aromatic, caramel-y iced coffee, brewed with demerara sugar and reminiscent of a classic Cuban Coffee - Pungent and sweet.  Available straight up, with Cajeta (our house made goat's milk caramel!), Chocolate Espanol or Cream and Sugar.  This week's contest winner gets a round (one of each) for 4 happy friends - Just in time for the  Sunny week to come! \n\nLIKE AND COMMENT TO WIN!!!  <3 #cubancoldbrewhasarrived #happydays #sunnydays #fritabatidos #notfakenews", "story": "Frita Batidos added 4 new photos.", "id": "157807164239203_1539521852734387"}, {"created_time": "2017-05-27T04:37:31+0000", "message": "Back by popular demand:) This wk's FRITA FACEBOOK FRIDAY CONTEST PRIZE is the new seasonal special - Plantain Fried Chix - Becoming an all time favorite - Come enjoy with a friend -> Chicken dinner for two!  \n\nHappy Happy Facebook Friday and see you soon@Frita Batidos", "id": "157807164239203_1532096650143574"}, {"created_time": "2017-05-20T06:36:15+0000", "message": "LET'S GET THIS PARTY STARTED (SUMMER!) Happy Facebook Friday!  The winner gets their choice of Frita Fishbowl to share w/friends...Sangria, Frita Margarita, Mojito, Pisco Lemonade or your fav concoction to enjoy during Happy Hour any day this week@Frita The choice is yours <3  \n\nLIKE AND COMMENT TO WIN!   #weheartsummer #letthegoodtimesroll #itsalwaysapartyatfrita #fishbowl #fritahappyhour", "id": "157807164239203_1524756424210930"}, {"created_time": "2017-05-13T04:54:20+0000", "message": "Wait for it....Introducing PLANTAIN FRIED CHICKEN@Frita Batidos  SI \nWe cannot get enough of Plantains here as you know and this upcoming seasonal special may end up being a keeper!  Be one of the first to taste bc the PFC is this wk's FRITA FB CONTEST PRIZE!  Served with slow cooked black beans, coconut ginger rice, cilantro lime salsa and some mojo dunking!\n\nLike and Comment to win and let us know what you think!!!! :) <3 and HAPPY FRITA FACEBOOK FRIDAY!", "id": "157807164239203_1517665011586738"}, {"created_time": "2017-05-12T20:01:44+0000", "message": "Awesome,food and service are 10 star.", "id": "157807164239203_1517292221624017"}, {"created_time": "2017-05-10T02:23:48+0000", "message": "Such a good burger spot !! Black bean Frita was amazing !! I will definitely be back with more friends", "id": "157807164239203_1514490225237550"}, {"created_time": "2017-05-06T23:10:07+0000", "message": "HAPPY BELATED FRITA FACEBOOK FRIDAY! \n\nHope everyone enjoyed the sunshine today :) This wk's prize is a preview taste of our new Happy Hour Special - HOT MESS FRIES - They were developed by the talented Ryan Deaner in our kitchen and they are DELICIOUS!  Think fresh cut Frita fries tossed with chiles, scallions, bacon and finished with melted muenster over the top (over the top being the key phrase :) :) accompanied with creme fraiche -and a Sunny Side Up egg if you wish - Pair these with two beers of your choice (For you and a friend - or two for you:) and we think you will be very happy!!  PS Sorry for the delay we were fine tuning the recipe and wanted to take a pic of the final product!  BUEN PROVECHO!\n\nLIKE AND COMMENT TO WIN! #hotmessfries #youcanteatjustone #socheesy #happyfbfridayquoteunquote", "id": "157807164239203_1511293668890539"}, {"created_time": "2017-04-29T15:39:10+0000", "message": "HAPPPPY FRITA FACEBOOK FRIDAY EVERYONE!\n\nCome in to try the brand spanking new (AMAZING) Churro Batido – Two Great things that taste GREAT together <3  One for you and one for a friend and then pls help us spread the word!! #thankryandeaner #staffinvention #whydidntwethinkofthissooner #???? #latepost\n\nComment And Like To Win!", "id": "157807164239203_1503233546363218"}, {"created_time": "2017-04-22T13:32:17+0000", "message": "HAPPY FACEBOOK FRITA FRIDAY!  In case you haven't visited us for our Happy Hour@Frita (Or in case you have and would like to do it again:) this week's contest prize is a happy hour experience for you and a buddy, soulmate, romantic interest, business associate or anyone you feel like bringing!  FYI we have happy hour Sunday through Thursday from 4 to 6 and during the last hour of service nightly for night owls (Like myself!!)\n\nLike and comment to win!\n\n#Fritafriday #happyhourjoy #joinus", "id": "157807164239203_1495463280473578"}, {"created_time": "2017-04-15T07:24:25+0000", "message": "HAPPPPY FRITA FACEBOOK FRIDAY EVERYONE!\n\nThis week's FBF contest is a chance to win a Special Seasonal Cocktail designed just for you!  It’s early strawberry season and we would love to create a lush, seasonal cocktail especially for you and a friend <3 to enjoy during any Happy Hour this coming week Frita Batidos :)", "id": "157807164239203_1487496807936892"}, {"created_time": "2017-04-08T03:58:10+0000", "message": "HAPPPPY FRITA FACEBOOK FRIDAY EVERYONE!  \n\n This week's FBF contest is a chance to win a  Frita Margarita to share to celebrate the warm weather :) Serves 4-6 thirsty guests (over 21 yrs old: ) and we’ll throw in some Crisped Plantains and Cilantro Lime salsa to round out your mini Margarita party! #thirstyfridays #FritaBatidosallspringlong", "id": "157807164239203_1477158868970686"}, {"created_time": "2017-04-04T20:04:44+0000", "message": "do you have conch fritters or when will you? I can't get to Miami this year.", "id": "157807164239203_1471997732820133"}, {"created_time": "2017-04-01T03:41:52+0000", "message": "This week's Frita Facebook Contest is a chance to win a Vegetarian Feast for Two – Back by popular demand!  Some of our most flavorful and satisfying dishes are vegetarian – Let us prepare and serve you a spread of our tantalizing vegetarian options #youwontleavehungry #youwontmissthemeat #fritabatidos Frita Batidos", "id": "157807164239203_1467234706629769"}, {"created_time": "2017-03-25T06:32:09+0000", "message": "Be one of the first to try the brand spanking new (and DEEELICIOUS) Churro Batido – Two Great things that taste GREAT together <3 I don’t know why we didn’t think of this sooner! (but KNOW you will love it as much as we all do) One for you and one for a friend and then pls help us spread the word!! #thankryandeaner #staffinvention #whydidntwethinkofthissooner #????", "id": "157807164239203_1458754790811094"}, {"created_time": "2017-03-25T05:43:14+0000", "message": "1. Be one of the first to try the brand spanking new (and DEEELICIOUS) Churro Batido – Two Great things that taste GREAT together <3 I don’t know why we didn’t think of this sooner!  (but KNOW you will love it as much as we all do) One for you and one for a friend and then pls help us spread the word!!  #thankryandeaner #staffinvention #whydidntwethinkofthissooner #????", "id": "157807164239203_1458721150814458"}, {"created_time": "2017-03-17T22:41:49+0000", "message": "HAPPPPPY ST PATRICK'S DAY EVERYONE!  Come enjoy the luck of the Irish@Frita :/ :) ?  But the mint cc chip Batido is pretty darn yummy (even in this blustery weather!)  SEE YOU SOON Frita Batidos", "id": "157807164239203_1450481488305091"}, {"created_time": "2017-03-17T22:23:58+0000", "message": "MMM Been working on lots of Seasonal Specials these days and this is my abs new fav!  Chix braised in Salsa Verde w/Lemon Scented Mayo, SS Fries and side of Trop Slaw (btw also available over Coconut Ginger Rice as a gluten free alternative, which honestly, I like even better than the sand) (which we LOVE, so think you would really enjoy:) \n\nSO....this week's FRITA FACEBOOK CONTEST should naturally be trying this new favorite sandwich (you and a friend of course:)!  LIKE AND COMMENT below to win and look out for more seasonal specials coming your way asap \n\n(#FritaMicheladas #happyhourhotmessfries #comingsoon #excited #atfrita)", "id": "157807164239203_1450458158307424"}, {"created_time": "2017-03-10T22:13:06+0000", "message": "HAPPY FRITA FB FRIDAY AND HAPPY ST PATRICK'S DAY IN ADVANCE!  We've been working on some new seasonal specials including some really yummy one's for SPD!  The price this week is a pair of deliciouusss Choc Chip Fresh Mint Batidos for you and yours!  LIKE AND COMMENT TO WIN and Come enjoy on St paddy's day! #likethebestshamrockshakeever #Fritalovesyouerrryday #luckoftheirish #magicallydelicious", "story": "Frita Batidos is feeling lucky.", "id": "157807164239203_1443114265708480"}, {"created_time": "2017-03-10T16:26:27+0000", "message": "We’re delighted to inform you that Frita Batidos has been selected as one of the best Restaurants in Michigan by Best of AmericanTowns, a property of AmericanTowns Media!  Here is the link to the page:\n\nhttp://bestthingsmi.com/restaurants/\n\nFor over 15 years, AmericanTowns Media has been the leader in highlighting the incredible work of great local organizations and initiatives. Best of AmericanTowns offers the most interesting and unique places in America right to the fingertips of the user with the opportunity to browse the best places to eat, live, and visit.\n\nWe are happy to spotlight the excellence you’ve achieved in your work and hope you’ll share this with your followers on Facebook and tag us @bestofamericantowns!\n\n#travelfreely", "id": "157807164239203_1324222897621459"}, {"created_time": "2017-03-05T21:18:26+0000", "message": "https://www.edibleproject.org/partners  \nAttention anyone with dietary preferences - we are now partners with the Edible Project! Their app lists all of our options for different dietary preferences for your convenience - Check them out! Don't forget we have a Menu Guide here@Frita Batidos available for your viewing pleasure:)! #edibleproject  #perfectpartners #dietarypreferences #menuguide #fritabatidos #weaimtoplease", "id": "157807164239203_1437744602912113"}, {"created_time": "2017-03-04T07:25:36+0000", "message": "Happy FRITA FACEBOOK FRIDAY BEAUTIFUL PEOPLE! \n\nThe contest prize this week is something that has never been offered before!  Skip the line!  Any day/any night/any time this coming week!  just might throw in some mini churros too :) :)\n\nLIKE! AND! COMMENT! To win!  Hope you are having as great a wkend as we are!  #coldbuthappy #seeyouatfrita #theresafirsttimeforeverything!  #muchlove", "id": "157807164239203_1436216146398292"}, {"created_time": "2017-02-25T05:18:33+0000", "message": "Happy Frita Facebook Friday Bikini weather is coming edition... :) \n\nThis wk's prize is a delightful and very healthy spread of our lighter options at Frita - I betcha didn't know how light you can eat at Frita - and trust me it is equally flavorful to the most decadent of options, I promise!  The winner and their companion will enjoy a Frita Lighter Plate (Spice rubbed roast porkloin over greens dressed with fresh lime and xv olive oil, avocado spread, Cilantro Lime Salsa and slow cooked black beans - as well as a lighter Frita of your choice (any Frita over romaine hold the shoestring fries/mayo) and two lighter batidos (fresh mango, passionfruit, wildflower honey, crushed ice and just a spoonful of ice cream) ENJOY @Frita Batidos :) \n\nLIKE AND COMMENT TO WIN!  Best of luck and #xflavor #wouldnthaveitanyotherway #fritafbfriday", "id": "157807164239203_1429511903735383"}, {"created_time": "2017-02-23T17:02:16+0000", "message": "Yall gonna hook me up if I come in today for my birthday?", "id": "157807164239203_1428002313886342"}, {"created_time": "2017-02-21T17:45:49+0000", "message": "Thanks Frita Batidos! It was great :)", "story": "Daniel Kaspo added a new photo to Frita Batidos's Timeline — at Frita Batidos.", "id": "157807164239203_10211781249064539"}, {"created_time": "2017-02-21T02:02:27+0000", "message": "This wk's FFFBCW (Frita Friday Facebook Winner:) is @DanielKaspo !! Come and get your SSFries and Batidos anytime this week - Buen Provecho!!!  Thank you all for your support today and every day!", "id": "157807164239203_1425508800802360"}, {"created_time": "2017-02-18T02:35:28+0000", "message": "Don't lie....we know you <3 to dunk your Shoestring Fries in your Batidos...(Hee hee hee) This week's Frita Facebook Friday Contest Prize = a Large order of Shoestring fries and two Batidos of your choice!  BC what's better than French fries and tropical milkshakes with a friend?:)! #pkyourpleasure #fritabatidos", "story": "Frita Batidos added 2 new photos.", "id": "157807164239203_1422254501127790"}, {"created_time": "2017-02-18T02:24:05+0000", "message": "@Frita Batidos IS HONORED TO BE INCLUDED IN USA TODAY's TEN BEST SLOW FOOD RESTAURANTS - In humbling company!", "id": "157807164239203_1422241081129132"}, {"created_time": "2017-02-14T20:51:09+0000", "message": "This week's Facebook winner is the lucky @AnneSabol and she wins this very beautiful new domino set! Yay! Feel free to come in anytime after tomorrow 2/15/17 to pickup your gift!\n\n Thank you to everyone and see you here this Friday (if not sooner)!!", "id": "157807164239203_1418768371476403"}, {"created_time": "2017-02-12T06:02:40+0000", "message": "1.  So sorry this didn't post on time!  2.  After years of searching for beautiful domino sets, found the most beautiful and ethereal set in our very own Detroit, MI....and while they are far too extravagant to grace our tbls Frita Batidos, we can certainly afford one set for a very special Frita Facebook \"Friday\"!\n\nLIKE AND COMMENT BELOW TO WIN! (and will announce Tues due to the belated post!!) #dominosinalltheirglory #gonnabejealousofthewinner #happysaturday", "id": "157807164239203_1416300485056525"}, {"created_time": "2017-02-04T04:38:24+0000", "message": "The prize this week is the only cold thing you want in your life right now!  Happy Facebook Friday!  Like and Comment to win a staff favorite, off the menu special!  and the first person who guesses what it is gets one too!  #offmenumenu  #alainandout #fritafriday #photocreditcamerone", "story": "Frita Batidos is at Frita Batidos.", "id": "157807164239203_1408060169213890"}, {"created_time": "2017-02-02T20:37:11+0000", "message": "\"MOST INSTA WORTHY\" @Frita Batidos :) Thanks Emily et al @Spoon University !", "id": "157807164239203_1406736532679587"}, {"created_time": "2017-01-31T21:50:03+0000", "message": "So glad you're looking for a place in Detroit. I love you're restaurant, but Ann Arbor is quite a trek from Dearborn, especially in the winter. I'm in Detroit a lot and am looking forward to being a frequent customer in your new location. 😋", "id": "157807164239203_1404539272899313"}, {"created_time": "2017-01-31T21:33:27+0000", "message": "Don't let the cold scare you away! Come on in and enjoy the tropics with our luscious Caipirinhas - muddled limes, sugar and cachaca! #fritabatidos #frita #caipirinha #cachaca #lusciouscocktails #drinks #housemade #annabor #stayinthetropicsatfrita", "id": "157807164239203_1404526966233877"}, {"created_time": "2017-01-28T15:43:57+0000", "message": "Read this, thought of you :)\n", "id": "157807164239203_10155769629752782"}, {"created_time": "2017-01-28T04:58:53+0000", "message": "In consideration of a lot of people telling us this has been the worst week ever, we would like to offer you the Best Snack Ever to cheer ya up!  And while we're at it, we might as well make it a double, so bring someone in who might be in need of a Best Snack Ever too!\nand you might need a tequila shot to wash that down with so if you are 21 or over, we'll throw that in too! \n\nHAPPY FRITA FACEBOOK FRIDAY AND Please like AND comment below to win! :) #BSE #onwardandupward #fritalovesyou\n\nEve", "id": "157807164239203_1400652753287965"}, {"created_time": "2017-01-20T17:35:54+0000", "message": "SOOOOO.....We interrupt your Inauguration Day pleasure with an important bulletin...We will be re-opening this Sunday for normal hours @11am        \n\n1. This is not eve re-visited, we WILL be re-opening asap, BUT due to noise from our repairs interfering with our neighbor's business, things took a bit longer than anticipated and we need to take another day to conclude our work at Frita.  2. As a token of our appreciation for your patience, we will be offering Happy Hour ALLLL DAY on SUNDAY (not SATURDAY) when we re-open - \n\nSo official re-opening will be this Sunday, January 22th at 11AM @Frita Batidos!  Thank you kindly!!  #wemissyou #pleasehelpuspassiton #thankyoukindly", "id": "157807164239203_1392618677424706"}, {"created_time": "2017-01-18T06:16:07+0000", "message": "OKAY - Re-opening from repairs/Frita Refresh slated for this FRIDAY pm....Will keep keeping you posted....", "id": "157807164239203_1390282580991649"}, {"created_time": "2017-01-15T20:09:15+0000", "message": "Best fit - Mid-town, Downtown, Corktown?! GO!", "story": "Frita Batidos is at Frita Batidos.", "id": "157807164239203_1388124881207419"}, {"created_time": "2017-01-15T04:27:49+0000", "message": "Thanks for all the LOVE! We spent the day in Detroit and feeling super excited! Will keep you posted! #fritadetroit", "story": "Frita Batidos shared The Ann Arbor News's post.", "id": "157807164239203_1387507457935828"}, {"created_time": "2017-01-14T05:23:30+0000", "message": "SO thanks to you all we get a lot of wear and tear and are going to be closed for several days to do some much needed repairs - We will be closing after service tonight/Saturday and hoping to re-open on Thursday (1/19) for dinner service at 5pm - We will keep you posted if we need another day but that's the plan\n\nSO come visit us today/tonight bc otherwise it's gonna be a few days - Sorry for any inconvenience and see you soon @Frita Batidos better and fresher than ever :)\n\nPS We will be back w/Frita Friday FB Contest next week!", "id": "157807164239203_1386474184705822"}, {"created_time": "2017-01-14T04:22:59+0000", "message": "It looks good!", "id": "157807164239203_1386437838042790"}, {"created_time": "2017-01-08T06:30:14+0000", "message": "LATE NIGHT FUN w/OPERATING MANUALS @Frita Batidos", "story": "Frita Batidos added 2 new photos.", "id": "157807164239203_1380700871949820"}, {"created_time": "2017-01-07T15:48:13+0000", "message": "Helloooo Ann Arbor! (And beyond:)!  What sounds like the best prize for this cold Michigan Winter week?  You tell us!  #brrrrrr #stillababyaboutthewinter #pickyourprize", "story": "Frita Batidos is at Frita Batidos.", "id": "157807164239203_1380141312005776"}, {"created_time": "2016-12-31T22:17:23+0000", "message": "Happy New Years Everyone!  \n\nWe are open until Midnight tonight so come visit us!  We will be closed on New Year's Day (Jan 1) in celebration of the holiday! \n\nThank you for your support, as always and can't wait to see you on the 2nd:)! \n\nMuch love from Everyone@Frita", "id": "157807164239203_1374166562603251"}, {"created_time": "2016-12-31T02:59:34+0000", "message": "Someone more hi-tech than myself SOS!  Why do our beautiful new pics keep disappearing...?  We are posting and then a minute or two later...pooof!  The pics disappear!?", "story": "Frita Batidos added 2 new photos.", "id": "157807164239203_1373342546018986"}, {"created_time": "2016-12-31T02:54:30+0000", "message": "HAPPY FRITA FACEBOOK FRIDAY BEAUTIFUL PPL! #rtontime #ha!  #heywheredourpicsgo?\nOur beloved friend and co-worker, the ever-talented Carmen Whatley, took these beeeautiful pics of our new FRITA COQUITO for us the other day (Thanks Carmen!)- Our new decadent dessert cocktail...Think warm, Coconut Cream Egg Nog spiked with Dark Rum and dusted with Cinnamon - SO, since this has become a hands down guest and staff favorite alike, it is only fitting that we offer a Coquito fishbowl to you as this week's prize to be enjoyed during any Happy Hour this coming week @Frita Batidos!\nLIKE AND COMMENT TO WIN! Try it and we know you'll love it <3", "story": "Frita Batidos updated their status.", "id": "157807164239203_1373339232685984"}, {"created_time": "2016-12-31T02:46:46+0000", "message": "HAPPY FRITA FACEBOOK FRIDAY BEAUTIFUL PPL! #rtontime #ha! \n\nOur beloved friend and co-worker, the ever-talented Carmen Whatley, took these beeeautiful pics of our new FRITA COQUITO for us the other day (Thanks Carmen!)- Our new decadent dessert cocktail...Think warm, Coconut Cream Egg Nog spiked with Dark Rum and dusted with Cinnamon - SO, since this has become a hands down guest and staff favorite alike, it is only fitting that we offer a Coquito fishbowl to you as this week's prize to be enjoyed during any Happy Hour this coming week Frita Batidos!  \n\nLIKE AND COMMENT TO WIN!  Try it and we know you'll love it <3", "story": "Frita Batidos updated their status.", "id": "157807164239203_1373334586019782"}, {"created_time": "2016-12-24T08:33:08+0000", "message": "Happy Facebook Friday Everyone! and Happy Happy Holidays whatever you celebrate!   Frita Facebook Contest prize this week = your fav Frita (any Frita, any toppings) and your fav Batido bc what could represent us better than that? :)  Wishing everyone a peaceful new year!  LOVE, Everyone @Frita Batidos\n\nLIKE AND COMMENT TO WIN!", "id": "157807164239203_1367702143249693"}, {"created_time": "2016-12-24T00:18:55+0000", "message": "Hello all!\n\nWe will be closed tomorrow at 3 pm for our Staff Holiday Party and Christmas!  We will reopen on December 26 at 11 am.  Sorry for the inconvenience.  Happy Holidays!\n\nEveryone@ Frita", "id": "157807164239203_1367451383274769"}, {"created_time": "2016-12-21T00:16:18+0000", "message": "DREAM QUEST - Spent an awesome day in Detroit yday w/our long time Frita crew looking at neighborhoods and spaces - We've been at this for a while, but if there's a will, there's a way!  <3", "story": "Frita Batidos is at Downtown Detroit.", "id": "157807164239203_1364903413529566"}, {"created_time": "2016-12-20T18:10:34+0000", "message": "I have been trying to set up an event to be catered for over two weeks. I have sent several emails and called multiple times. A few times, no one even picked up. On the rare occasion the phone was answered I was told no one has the information except for the manager and my email would be returned immediately. Well I am still waiting and the party is right after the holiday break.... Looks like I am going to have to explore some other options. VERY DISAPPOINTING CUSTOMER SERVICE", "id": "157807164239203_1364640656889175"}], "paging": {"cursors": {"before": "Q2c4U1pXNTBYM0YxWlhKNVgzTjBiM0o1WDJsa0R5TXhOVGM0TURjeE5qUXlNemt5TURNNk16YzNNVEV3TlRZAM056UTFNalEyT0RRME5nOE1ZAWEJwWDNOMGIzSjVYMmxrRHlBeE5UYzRNRGN4TmpReU16a3lNRE5mTVRjeU1qWTVOams0TkRReE5qZAzNNZAzhFZAEdsdFpRWmFHUnphQVE9PQZDZD", "after": "Q2c4U1pXNTBYM0YxWlhKNVgzTjBiM0o1WDJsa0R5SXhOVGM0TURjeE5qUXlNemt5TURNNk1qSXpOemc0TURRNU5ESTNNRFl6TVRrMER3eGhjR2xmYzNSdmNubGZAhV1FQSURFMU56ZA3dOekUyTkRJek9USXdNMTh4TXpZAME5qUXdOalUyT0RnNU1UYzFEd1IwYVcxbEJsaFpkQm9C"}, "next": "https://graph.facebook.com/v2.11/157807164239203/feed?access_token=135756800477398%7CanRtlRbE9MHfxKAZ5RjfTybAP2M&limit=100&after=Q2c4U1pXNTBYM0YxWlhKNVgzTjBiM0o1WDJsa0R5SXhOVGM0TURjeE5qUXlNemt5TURNNk1qSXpOemc0TURRNU5ESTNNRFl6TVRrMER3eGhjR2xmYzNSdmNubGZAhV1FQSURFMU56ZA3dOekUyTkRJek9USXdNMTh4TXpZAME5qUXdOalUyT0RnNU1UYzFEd1IwYVcxbEJsaFpkQm9C"}}}